iuclid_5-ws/src/main/resources/net/idea/i5/cli/querytool/query_by_it_identifier.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:typ="http://echa.europa.eu/schemas/iuclid5/i5webservice/types/">
   <soap:Header/>
   <soap:Body>
      <typ:countQueryExpression>
         <typ:session typ:id="%s"/>
         <typ:expression typ:dataLayer="?" typ:comment="?">
            <typ:SimpleQueryBlock typ:fieldRestriction="Substance" typ:indexType="Substance">
               <typ:queryFields>
                  <typ:StringQueryField typ:caseSensitive="false">
                     <typ:QueryField typ:fieldName="/externalSystemIdentifiers/externalSystemDesignator" typ:ID="S01.03.0060"/>
                     <typ:values>
                        <typ:StringQueryValue typ:searchExpression="%s" typ:op="EQUALS"/>
                     </typ:values>
                  </typ:StringQueryField>
         			<typ:StringQueryField typ:caseSensitive="false">
                     <typ:QueryField typ:fieldName="/externalSystemIdentifiers/ID" typ:ID="S01.03.0070"/>
                     <typ:values>
                        <typ:StringQueryValue typ:searchExpression="%s" typ:op="EQUALS"/>
                     </typ:values>
                  </typ:StringQueryField>
               </typ:queryFields>
            </typ:SimpleQueryBlock>
         </typ:expression>
      </typ:countQueryExpression>
   </soap:Body>
</soap:Envelope>